# 리스트의 CRUD3S
# C: create.
# R: read
# U: update
# D: delete
# S: search
# S: sort
# S: shuffle


############################
# 리스트 선언

# 공백 리스트 생성
# 문자 H, e, l, l, o를 요소로 가지는 리스트
# 문자열 Hello를 요소로 가지는 리스트
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
# 공백 리스트 생성
# 문자열을 리스트로 변환. 문자 H, e, l, l, o를 요소로 가지는 리스트 생성
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
############################
############################
# 리스트 요소 출력
############################

############################
# 리스트 출력
############################

############################
# 리스트 슬라이싱
############################

############################
# 리스트 요소 대입
############################

############################
# 리스트 열거
############################

############################
# 복잡한 리스트
# 1차원 리스트
# 2차원 리스트
# 3차원 리스트
############################


############################
# 리스트에 담을 수 있는 것은?
# 리스트 선언
# 리스트 대입
# 리스트 출력
# 리스트 열거
# 리스트에 저장된 함수 실행하기
############################

############################
# 문자열 vs 리스트
############################
