# 정수를 입력을 받습니다.
# 입력 받은 문자열을 정수로 바꿉니다.

a=input("정수를 입력하시오: ")
a=int(a)
#if a==0:
#    a=input("0 이 아닌 자연수를 입력하시오: ")
#    a=int(a)
#if a!=0 and a%2==0:
if a%2==0:
    print("입력된 정수는 짝수입니다.")
if a%2!=0:
    print("입력된 정수는 홀수입니다.")
# if a==0:
#    print("입력된 0은 자연수가 아닙니다.")






# 문자열로 변환


#######################################
# 방법1. 문자열을 사용하는 방법
# 방법2. 나머지를 사용하는 방법
#######################################

#######################################
# 방법1. 문자열을 사용하는 방법
#######################################
# 마지막 자리 숫자를 추출
a=input("정수를 입력하시오: ")
b=a[-1]
#print(b)




# 숫자로 변환하기

# 짝수 확인

# 홀수 확인


#######################################
# 방법2. 나머지를 사용하는 방법
#######################################

# 짝수 조건

# 홀수 조건
